Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: Building C and C++ Extensions with distutils
pl: Budowanie Rozszerzeń C i C++ za pomocą distutils

source: Starting in Python 1.4, Python provides, on Unix, a special make file for building make files for building dynamically-linked extensions and custom interpreters. Starting with Python 2.0, this mechanism (known as related to Makefile.pre.in, and Setup files) is no longer supported. Building custom interpreters was rarely used, and extension modules can be built using distutils.
pl: Poczynając od języka pytonowskiego w wersji 1.4 język pytonowski dostarcza w Unixie, szczególny plik make-file dla budowania plików make-file dla budowania dynamicznie-łączonych rozszerzeń i szczególnych programów interpretujących. Poczynając od wersji języka pytonowskiego 2.0, ten mechanizm (znany jako związany z Makefile.pre.in, i plikami instalacyjnymi) nie jest już wspierany. Budowanie szczególnych programów interpretujących było rzadko używane, i moduły rozszerzające mogą być budowane przy użyciu distutils.

source: Building an extension module using distutils requires that distutils is installed on the build machine, which is included in Python 2.x and available separately for Python 1.5. Since distutils also supports creation of binary packages, users don't necessarily need a compiler and distutils to install the extension.
pl: Budowanie modułu rozszerzającego przy użyciu distutils wymaga aby distutils było zainstalowane na maszynie budującej, co jest załączone w wersjach języka pytonowskiego 2.x i dostępne oddzielnie dla języka pytonowskiego w wersji 1.5 Od kiedy distutils także wspiera tworzenie pakietów binarnych, użytkownicy nie muszą koniecznie potrzebować kompilatora i distutils aby zainstalować rozszerzenie.

source: A distutils package contains a driver script, :file:`setup.py`. This is a plain Python file, which, in the most simple case, could look like this::
pl: Pakiet distutils zawiera skrypt sterownika, :file:`setup.py`. To jest czysto pytonowski plik, który w najprostszym przypadku, może wyglądać następująco::

source: from distutils.core import setup, Extension module1 = Extension('demo', sources = ['demo.c']) setup (name = 'PackageName', version = '1.0', description = 'This is a demo package', ext_modules = [module1])
pl: from distutils.core import setup, Extension module1 = Extension('demo', sources = ['demo.c']) setup (name = 'NazwaPakietu', version = '1.0', description = 'To jest pakiet demo', ext_modules = [module1])

source: With this :file:`setup.py`, and a file :file:`demo.c`, running ::
pl: Z tym plikiem :file:`setup.py`, i plikiem :file:`demo.c`, uruchomienie ::

source: will compile :file:`demo.c`, and produce an extension module named ``demo`` in the :file:`build` directory. Depending on the system, the module file will end up in a subdirectory :file:`build/lib.system`, and may have a name like :file:`demo.so` or :file:`demo.pyd`.
pl: skompiluje plik :file:`demo.c`, i wytworzy moduł rozszerzający nazwany ``demo`` w katalogu :file:`build`. W zależności od systemu plik modułu wyląduje w podkatalogu :file:`build/lib.system` i może mieć nazwę taką, jak :file:`demo.so` lub :file:`demo.pyd`.

source: In the :file:`setup.py`, all execution is performed by calling the ``setup`` function. This takes a variable number of keyword arguments, of which the example above uses only a subset. Specifically, the example specifies meta-information to build packages, and it specifies the contents of the package. Normally, a package will contain of addition modules, like Python source modules, documentation, subpackages, etc. Please refer to the distutils documentation in :ref:`distutils-index` to learn more about the features of distutils; this section explains building extension modules only.
pl: W pliku :file:`setup.py`, wszystkie operacje są wykonywane przez wywołanie zadania ``setup``. To pobiera zmienną liczbę kluczowych parametrów, z których przykład powyższy używa tylko podzbioru. Szczególnie, przykład określa informacje pośrednie aby zbudować pakiety, i określa zawartość pakietu. Zwykle pakiet będzie zawierał dodatek modułów takich jak moduły źródłowe języka pytonowskiego, dokumentację, podpakiety, itp. Uprasza się o zajrzenie do dokumentacji distutils do :ref:`distutils-index` aby dowiedzieć się więcej o właściwościach distutils; ten rozdział wyjaśnia tylko budowanie modułów rozszerzeń.

source: It is common to pre-compute arguments to :func:`setup`, to better structure the driver script. In the example above, the\ ``ext_modules`` argument to :func:`setup` is a list of extension modules, each of which is an instance of the :class:`Extension`. In the example, the instance defines an extension named ``demo`` which is build by compiling a single source file, :file:`demo.c`.
pl: Jest często spotykane aby uprzednio obliczać parametry dla zadania :func:`setup`, aby lepiej rozłożyć skrypt sterownika. W przykładzie powyższym parametr \ ``ext_modules`` dla zadania :func:`setup` jest listą rozszerzających modułów, z których każdy jest przykładem uogólnienia :class:`Extension`. W tym przypadku, przykład definiuje rozszerzenie nazwane ``demo`` które jest budowane przez skompilowanie pojedynczego pliku źródłowego, :file:`demo.c`.

source: In many cases, building an extension is more complex, since additional preprocessor defines and libraries may be needed. This is demonstrated in the example below. ::
pl: W wielu przypadkach, budowanie rozszerzenia jest bardziej skomplikowane, gdyż dodatkowe definicje preprocesora i biblioteki mogą być potrzebne. To jest demonstrowane w przykładzie poniżej. ::

source: from distutils.core import setup, Extension module1 = Extension('demo', define_macros = [('MAJOR_VERSION', '1'), ('MINOR_VERSION', '0')], include_dirs = ['/usr/local/include'], libraries = ['tcl83'], library_dirs = ['/usr/local/lib'], sources = ['demo.c']) setup (name = 'PackageName', version = '1.0', description = 'This is a demo package', author = 'Martin v. Loewis', author_email = 'martin@v.loewis.de', url = 'http://docs.python.org/extending/building', long_description = ''' This is really just a demo package. ''', ext_modules = [module1])
pl: from distutils.core import setup, Extension module1 = Extension('demo', define_macros = [('MAJOR_VERSION', '1'), ('MINOR_VERSION', '0')], include_dirs = ['/usr/local/include'], libraries = ['tcl83'], library_dirs = ['/usr/local/lib'], sources = ['demo.c']) setup (name = 'NazwaPakietu', version = '1.0', description = 'To jest pakiet demo', author = 'Martin v. Loewis', author_email = 'martin@v.loewis.de', url = 'http://docs.python.org/extending/building', long_description = ''' To jest na prawdę tylko pakiet demo. ''', ext_modules = [module1])

source: In this example, :func:`setup` is called with additional meta-information, which is recommended when distribution packages have to be built. For the extension itself, it specifies preprocessor defines, include directories, library directories, and libraries. Depending on the compiler, distutils passes this information in different ways to the compiler. For example, on Unix, this may result in the compilation commands ::
pl: W tym przykładzie, zadanie :func:`setup` jest wywoływane z dodatkowymi informacjami pośrednimi, co jest zalecane gdy pakiety dystrybucji maja być zbudowane. Dla tego rozszerzenia samego w sobie, określa ona definicje preprocesora, katalogi załączane, katalogi bibliotek, i biblioteki. W zależności od kompilatora, distutils przekazuje tą informację w różny sposób kompilatorowi. Na przykład w Unix-ie, to może dawać rezultat poleceń kompilacji ::

source: These lines are for demonstration purposes only; distutils users should trust that distutils gets the invocations right.
pl: Te linie są dla celów demonstracyjnych tylko i wyłącznie; użytkownicy distutils powinni ufać że distutils wystosuje właściwe odwołania.

source: Distributing your extension modules
pl: Rozprowadzanie swoich modułów rozszerzających

source: When an extension has been successfully build, there are three ways to use it.
pl: Kiedy rozszerzenie zostało z powodzeniem zbudowane, są trzy sposoby aby go użyć.

source: End-users will typically want to install the module, they do so by running ::
pl: Użytkownicy końcowi będą najczęściej chcieć zainstalować moduł, będą mogli to zrobić uruchamiając ::

source: Module maintainers should produce source packages; to do so, they run ::
pl: Zarządcy modułów powinni wyprodukować źródłowe pakiety; aby tego dokonać, uruchomią oni ::

source: In some cases, additional files need to be included in a source distribution; this is done through a :file:`MANIFEST.in` file; see the distutils documentation for details.
pl: W niektórych przypadkach, dodatkowe pliki są potrzebne w dystrybucji źródłowej; tego dokonuje się przez plik :file:`MANIFEST.in`; sięgnij do dokumentacji distutils po więcej szczegółów.

source: If the source distribution has been build successfully, maintainers can also create binary distributions. Depending on the platform, one of the following commands can be used to do so. ::
pl: Jeśli dystrybucja źródłowa została zbudowana szczęśliwie, zarządcy mogą także tworzyć dystrybucje binarne. W zależności od środowiska/maszyny, jedna z następujących komend może być użyta aby tego dokonać. ::

source: Embedding Python in Another Application
pl: Załączanie języka pytonowskiego w innej aplikacji

source: The previous chapters discussed how to extend Python, that is, how to extend the functionality of Python by attaching a library of C functions to it. It is also possible to do it the other way around: enrich your C/C++ application by embedding Python in it. Embedding provides your application with the ability to implement some of the functionality of your application in Python rather than C or C++. This can be used for many purposes; one example would be to allow users to tailor the application to their needs by writing some scripts in Python. You can also use it yourself if some of the functionality can be written in Python more easily.
pl: Poprzednie rozdziały opisywały jak rozszerzać język pytonowski, to jest, jak rozszerzać zdolności działania języka pytonowskiego przez dołączanie biblioteki zadań C do niego. Jest także możliwe robienie tego w drugą stronę: wzbogacić twoją aplikcję C/C++ przez załączenie pytona w niej. Załączanie dostarcza twojej aplikacji zdolność wypełnienia niektórych zadań twojej aplikacji w języku pytonowskim zamiast w C lub C++. To może zostać wykorzystane w wielu celach; jednym z przykładów byłoby pozwolenie innym użytkownikom dostosowanie aplikacji do swoich potrzeb przez napisanie pewnych skryptów w języku pytonowskim. Możesz też użyć tego samodzielnie jeśli niektóre z zadań mogą być napisane w języku pytonowskim nieco łatwiej.

source: Embedding Python is similar to extending it, but not quite. The difference is that when you extend Python, the main program of the application is still the Python interpreter, while if you embed Python, the main program may have nothing to do with Python --- instead, some parts of the application occasionally call the Python interpreter to run some Python code.
pl: Załączanie języka pytonowskiego jest podobne do rozszerzania go, ale nie całkiem. Różnica polega na tym, że gdy rozszerzasz język pytonowski, głównym programem aplikacji jest wciąż program interpretujący polecenia języka pytonowskiego, podczas gdy jeśli załączasz język pytonowski, główny program może nie mieć nic wspólnego z językiem pytonowskim --- zamiast tego, niektóre części aplikacji czasami wzywają program interpretujący polecenia języka pytonowskiego aby uruchomić pewien kod języka pytonowskiego.

source: So if you are embedding Python, you are providing your own main program. One of the things this main program has to do is initialize the Python interpreter. At the very least, you have to call the function :cfunc:`Py_Initialize`. There are optional calls to pass command line arguments to Python. Then later you can call the interpreter from any part of the application.
pl: Więc jeśli załączasz język pytonowski, dostarczasz wtedy swój własny program główny. Jedną z rzeczy którą ten program główny musi zrobić jest zainicjować program interpretujący polecenia języka pytonowskiego. Na sam koniec, trzeba wywołać zadanie :cfunc:`Py_Initialize`. Istnieją opcjonalne wywołania aby przekazać parametry wiersza polecenia dla języka pytonowskiego. Potem później możesz odwołać się do programu interpretującego polecenia języka pytonowskiego z każdej części aplikacji.

source: There are several different ways to call the interpreter: you can pass a string containing Python statements to :cfunc:`PyRun_SimpleString`, or you can pass a stdio file pointer and a file name (for identification in error messages only) to :cfunc:`PyRun_SimpleFile`. You can also call the lower-level operations described in the previous chapters to construct and use Python objects.
pl: Istnieje kilka różnych sposobów aby wywołać program interpretujący polecenia języka pytonowskiego: możesz przekazać ciąg znaków zawierający wyrażenia języka pytonowskiego do zadania :cfunc:`PyRun_SimpleString`, lub możesz przekazać wskaźnik pliku stdio i nazwę pliku (tylko dla rozróżnienia w wiadomościach o błędach) dla zadania :cfunc:`PyRun_SimpleFile`. Możesz także wywołać nisko-poziomowe operacje opisane w poprzednich rozdziałach aby tworzyć i używać przedmiotów języka pytonowskiego.

source: A simple demo of embedding Python can be found in the directory :file:`Demo/embed/` of the source distribution.
pl: Proste demo załączania języka pytonowskiego może być znalezione w katalogu :file:`Demo/embed/` źródłowej dystrybucji.

source: See also
pl: Zobacz także

source: The details of Python's C interface are given in this manual. A great deal of necessary information can be found here.
pl: Szczegóły sprzęgu C języka pytonowskiego są dane w tym podręczniku. Większość koniecznych informacji może być znaleziona tutaj.

source: Very High Level Embedding
pl: Bardzo wysokiego poziomu załączanie

source: The simplest form of embedding Python is the use of the very high level interface. This interface is intended to execute a Python script without needing to interact with the application directly. This can for example be used to perform some operation on a file. ::
pl: Najprostszy sposób załączania języka pytonowskiego polega na tym, aby użyć sprzęgu bardzo wysokiego poziomu. Ten sprzęg jest przeznaczony aby wykonać skrypt języka pytonowskiego bez potrzeby współdziałania z aplikacją bezpośrednio. To może dla przykładu być użyte aby wykonać pewne operacje na pliku. ::

source: #include <Python.h> int main(int argc, char *argv[]) { Py_Initialize(); PyRun_SimpleString("from time import time,ctime\n" "print('Today is', ctime(time()))\n"); Py_Finalize(); return 0; }
pl: #include <Python.h> int main(int argc, char *argv[]) { Py_Initialize(); PyRun_SimpleString("from time import time,ctime\n" "print('Dziś jest', ctime(time()))\n"); Py_Finalize(); return 0; }

source: The above code first initializes the Python interpreter with :cfunc:`Py_Initialize`, followed by the execution of a hard-coded Python script that print the date and time. Afterwards, the :cfunc:`Py_Finalize` call shuts the interpreter down, followed by the end of the program. In a real program, you may want to get the Python script from another source, perhaps a text-editor routine, a file, or a database. Getting the Python code from a file can better be done by using the :cfunc:`PyRun_SimpleFile` function, which saves you the trouble of allocating memory space and loading the file contents.
pl: Powyższy kod najpierw inicjuje program interpretujący polecenia języka pytonowskiego za pomocą zadania :cfunc:`Py_Initialize` po którym następuje wykonanie skryptu zakodowanego na sztywno który wypisuje datę i czas. Po wszystkim, odwołanie :cfunc:`Py_Finalize` zamyka program interpretujący polecenia języka pytonowskiego, po którym następuje koniec programu. W rzeczywistym programie, możesz chcieć pobrać skrypt języka pytonowskiego z innego źródła, być może ze sposobu postępowania edytora-tekstu, pliku, lub bazy danych. Pobranie kodu języka pytonowskiego z pliku może być lepiej zrobione przez użycie zadania :cfunc:`PyRun_SimpleFile`, które ratuje cię przed trudami lokowania przestrzeni w pamięci i ładowania zawartości pliku.

source: Beyond Very High Level Embedding: An overview
pl: Poza bardzo wysokiego poziomu załączaniem: Przegląd

source: The high level interface gives you the ability to execute arbitrary pieces of Python code from your application, but exchanging data values is quite cumbersome to say the least. If you want that, you should use lower level calls. At the cost of having to write more C code, you can achieve almost anything.
pl: Sprzęg wysokiego poziomu daje ci możliwość wykonania zadanych kawałków kodu języka pytonowskiego ze swojej aplikacji, ale wymiana wartości danych jest całkiem kłopotliwa, prawdę powiedziawszy. Jeśli tego oczekujesz powinieneś użyć niższego poziomu wywołań. Kosztem konieczności pisania większej ilości kodu C, możesz osiągnąć prawie wszystko.

source: It should be noted that extending Python and embedding Python is quite the same activity, despite the different intent. Most topics discussed in the previous chapters are still valid. To show this, consider what the extension code from Python to C really does:
pl: Powinno się zauważyć, że rozszerzanie języka pytonowskiego i wstawianie języka pytonowskiego jest prawie całkiem taką samą działalnością, z wyjątkiem odmienności celów. Większość tematów rozważanych w poprzednich rozdziałach jest wciąż poprawna. Aby to pokazać, rozważ co kod rozszerzający z języka pytonowskiego do C robi naprawdę:

source: Convert data values from Python to C,
pl: Konwertuj wartości danych z języka pytonowskiego do C

source: Perform a function call to a C routine using the converted values, and
pl: Wykonaj odwołanie do zadania C używając zamienionych wartości, i

source: Convert the data values from the call from C to Python.
pl: Zamień wartości danych z wywołania z C do języka pytonowskiego.

source: When embedding Python, the interface code does:
pl: Gdy załączasz język pytonowski, kod sprzęgający wykonuje:

source: Convert data values from C to Python,
pl: Zamienia wartości danych z C do języka pytonowskiego,

source: Perform a function call to a Python interface routine using the converted values, and
pl: Wykonaj wywołanie zadania do sprzęgu języka pytonowskiego używając zamienionych wartości, i

source: Convert the data values from the call from Python to C.
pl: Zamień wartości danych z odwołania z języka pytonowskiego do C.

source: As you can see, the data conversion steps are simply swapped to accommodate the different direction of the cross-language transfer. The only difference is the routine that you call between both data conversions. When extending, you call a C routine, when embedding, you call a Python routine.
pl: Jak możesz się zorientować, kroki zamiany danych są po prostu zamienione aby umożliwić odwrócenie kierunku między-językowego transferu. Jedyną różnicą jest zadanie które wywoływane jest pomiędzy obiema zamianami danych. Gdy rozszerzasz, wywołujesz zadanie C, gdy załączasz, wywołujesz zadanie języka pytonowskiego.

source: This chapter will not discuss how to convert data from Python to C and vice versa. Also, proper use of references and dealing with errors is assumed to be understood. Since these aspects do not differ from extending the interpreter, you can refer to earlier chapters for the required information.
pl: Ten rozdział nie będzie rozważał jak zamienić dane z języka pytonowskiego do C i w przeciwnym kierunku. Także właściwe użycie odniesień i obsługa błędów zakłada się że jest znajoma. Jako że te sprawy nie różnią się od rozszerzania programu interpretującego polecenia języka pytonowskiego, możesz odnieść się do wcześniejszych rozdziałów po wymagane informacje.

source: Pure Embedding
pl: Czyste załączanie

source: The first program aims to execute a function in a Python script. Like in the section about the very high level interface, the Python interpreter does not directly interact with the application (but that will change in the next section).
pl: Pierwszy program ma na celu wykonanie zadania w skrypcie języka pytonowskiego. Jak w rozdziale o sprzęgu bardzo wysokiego poziomu, program interpretujący polecenia języka pytonowskiego bezpośrednio nie oddziałuje z aplikacją (ale to się zmieni w następnym rozdziale).

source: The code to run a function defined in a Python script is:
pl: Kod służący uruchomieniu zadania określonego w skrypcie języka pytonowskiego to:

source: #include <Python.h> int main(int argc, char *argv[]) { PyObject *pName, *pModule, *pDict, *pFunc; PyObject *pArgs, *pValue; int i; if (argc < 3) { fprintf(stderr,"Usage: call pythonfile funcname [args]\n"); return 1; } Py_Initialize(); pName = PyUnicode_FromString(argv[1]); /* Error checking of pName left out */ pModule = PyImport_Import(pName); Py_DECREF(pName); if (pModule != NULL) { pFunc = PyObject_GetAttrString(pModule, argv[2]); /* pFunc is a new reference */ if (pFunc && PyCallable_Check(pFunc)) { pArgs = PyTuple_New(argc - 3); for (i = 0; i < argc - 3; ++i) { pValue = PyLong_FromLong(atoi(argv[i + 3])); if (!pValue) { Py_DECREF(pArgs); Py_DECREF(pModule); fprintf(stderr, "Cannot convert argument\n"); return 1; } /* pValue reference stolen here: */ PyTuple_SetItem(pArgs, i, pValue); } pValue = PyObject_CallObject(pFunc, pArgs); Py_DECREF(pArgs); if (pValue != NULL) { printf("Result of call: %ld\n", PyLong_AsLong(pValue)); Py_DECREF(pValue); } else { Py_DECREF(pFunc); Py_DECREF(pModule); PyErr_Print(); fprintf(stderr,"Call failed\n"); return 1; } } else { if (PyErr_Occurred()) PyErr_Print(); fprintf(stderr, "Cannot find function \"%s\"\n", argv[2]); } Py_XDECREF(pFunc); Py_DECREF(pModule); } else { PyErr_Print(); fprintf(stderr, "Failed to load \"%s\"\n", argv[1]); return 1; } Py_Finalize(); return 0; }
pl: #include <Python.h> int main(int argc, char *argv[]) { PyObject *pName, *pModule, *pDict, *pFunc; PyObject *pArgs, *pValue; int i; if (argc < 3) { fprintf(stderr,"Użycie: wywołaj plikpytona nazwazadania [parametry]\n"); return 1; } Py_Initialize(); pNazwa = PyUnicode_FromString(argv[1]); /* Sprawdzanie błędu pNazwy pomienięte */ pModule = PyImport_Import(pNazwa); Py_DECREF(pNazwa); if (pModule != NULL) { pFunc = PyObject_GetAttrString(pModule, argv[2]); /* pFunc jest nowym odniesieniem */ if (pFunc && PyCallable_Check(pFunc)) { pArgs = PyTuple_New(argc - 3); for (i = 0; i < argc - 3; ++i) { pValue = PyLong_FromLong(atoi(argv[i + 3])); if (!pValue) { Py_DECREF(pArgs); Py_DECREF(pModule); fprintf(stderr, "Nie mogę zamienić parametrów\n"); return 1; } /* odniesienie do pValue kradzione tutaj: */ PyTuple_SetItem(pArgs, i, pValue); } pValue = PyObject_CallObject(pFunc, pArgs); Py_DECREF(pArgs); if (pValue != NULL) { printf("Wynik wywołania: %ld\n", PyLong_AsLong(pValue)); Py_DECREF(pValue); } else { Py_DECREF(pFunc); Py_DECREF(pModule); PyErr_Print(); fprintf(stderr,"Wywołanie zawiodło\n"); return 1; } } else { if (PyErr_Occurred()) PyErr_Print(); fprintf(stderr, "Nie mogę znaleźć zadania \"%s\"\n", argv[2]); } Py_XDECREF(pFunc); Py_DECREF(pModule); } else { PyErr_Print(); fprintf(stderr, "Nieudane ładowanie \"%s\"\n", argv[1]); return 1; } Py_Finalize(); return 0; }
